#!/bin/bash


#-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#  1、设置什么时候执行
#  2、登录boss
#  3、根据时间条件查找想要查询的值
#  4、根据 jq 将数据进行筛选
#  5、保存成.csv格式文件
#  6、发送邮件
#-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


#-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#   curl 命令参数
#  -s 选项：加上此选项，不显示请求内容的进度信息
#  -c 选项: 参数将服务器设置的 Cookie 写入一个文件
#  -k 选项: 参数指定跳过 SSL 检测
#  -b 选项: 参数用来向服务器发送 Cookie
#
#
#1、每周一执行
#0 0 * * 1 ./root/a.sh
#*/1 * * * *  /root/a.sh


#-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#2、登录boss
curl -s -k -c cookie.ck 'https://boss.pppcloud.cn/smartBus-Manager-v1/users/login?username=zabbix&password=D2u1rZav1muFDgsrQZsi' >/dev/null


#-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#3、根据业务状态和时间进行筛选


#-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#4、将查询到结果进行数据筛选，之后存到当前时间.log中
#4.1打印显示表头
echo '客户邮箱 ,子账号 ,cpu ,内存 ,系统盘大小-GB ,数据盘大小-GB ,磁盘类型 ,自动备份周数 ,自动备份天数 ,带宽 ,创建时间 ,服务开始时间 ,服务到期时间 ,service_code ,Zone' >`date +%Y%m%d`.log

curl -s -k -b cookie.ck 'https://boss.pppcloud.cn/smartBus-Manager-v1/arrows?business=NORMAL&create_time_min='$(date -d "7 days ago" +%F)'+00%3A00%3A00&create_time_max='$(date +%F)'+00%3A00%3A00&limit=500' \
	|jq -c '.data[] | {"客户邮箱":.customer.email,"子账号":.sub_account_login_name,"cpu":.cpu,"内存":.memory,"系统盘大小-GB":.sys_space,"数据盘大小-GB":.data_space,"磁盘类型":.disk_type,"自动备份周数":.auto_backup_week_num,"自动备份天数":.auto_backup_day_num,"带宽":.networks[1].band_width,"创建时间":.create_time,"服务开始时间":.begin_time,"服务到 期时间":.expire_time,"service_code":.service_code,"Zone":.zone.name}'\
	|awk -F \" '{print $4,"," $8,"," $11,$13,$15,$17,$20,"," $23,$25,$27,$30, "," $34, ","$38, ","$42, ","$46}' \
	|grep -Ev 'sunjianxing@xinnet.com|tianyuanming@xinnet.com|wanghe@xinnet.com|xusixian@xinnet.com|chenyukun@xinnet.com|guojing@xinnet.com|jtyyunwei@xinnet.com'\
	|awk -F \: '{print $1,$2,$3,$4,$5,$6,$7,($8":"$9":"$10),($11":"$12":"$13":"$14)}' \
	>> `date +%Y%m%d`.log



#4.2打印筛选数据追击到时间。log文件中


#-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#5.转换为 .csv格式的文件
iconv -f UTF-8 -t GBK `date +%Y%m%d`.log -o `date +%Y%m%d`.csv



#-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#6.mail发送邮件
#	curl 命令参数
#	-r 发件人邮箱
#	-s 邮件主题
#	-a 附件
#	-c 抄送

#6.1统计云主机新增数量
#发送邮件给 xusixian@xinnet.com

hostnum=$(cat `date +%Y%m%d`.log |grep -v "客户邮箱"|wc -l)
echo -e "各位好: \n附件为箭头云从 `date -d "7 days ago" +%m月%d日` 到 `date +%m月%d日` 新增云主机详细信息,其中新增主机 $hostnum 台" \
	| mail -r jiantouyun_monitor@pppcloud.cn \
		-s "箭头云监控上周新增云主机信息--`date +%Y%m%d`" \
		-a `date +%Y%m%d`.csv \
		cloud_ops@xinnet.com

rm -rf `date +%Y%m%d`.log
rm -rf `date +%Y%m%d`.csv
rm -rf cookie.ck
